doc/html/overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Overview</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="<2010-10-21 Wed>"/>
<meta name="author" content="Shrutarshi Basu"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/metaphor.css" />
</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Overview</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Overview </a>
<ul>
<li><a href="#sec-1.1">1.1 What is Metaphor? </a></li>
<li><a href="#sec-1.2">1.2 What Metaphor isn't. </a></li>
<li><a href="#sec-1.3">1.3 Where am I? </a></li>
<li><a href="#sec-1.4">1.4 Who made Metaphor? Why? </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Overview </h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> What is Metaphor? </h3>
<div class="outline-text-3" id="text-1.1">

<p>Metaphor is meant to be a tool to explore generative formal grammars,
especially Lindenmayer systems and the patterns they create. It is designed to
allow scientists and artists to use computers to explore the patterns they see
in their daily work without having to resort to learning extensive
programming. 
</p>
<p>
Metaphor is:
</p>
<ul>
<li>
A simplified language for describing patterns as <a href="http://en.wikipedia.org/wiki/L-system">Lindenmayer Systems</a>
</li>
<li>
An engine to automatically generate strings based on those systems
</li>
<li>
A set of contexts in which to render the strings as graphics (or sound)

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> What Metaphor isn't. </h3>
<div class="outline-text-3" id="text-1.2">

<p>Metaphor is not:
</p><ul>
<li>
A general purpose progamming language/environment
</li>
<li>
A graphics editing programming (a la Photoshop, the GIMP)
</li>
<li>
A replacement for other computational art tools like <a href="http://processing.org">Processing</a>

</li>
</ul>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Where am I? </h3>
<div class="outline-text-3" id="text-1.3">

<p>You are in the Metaphor documenatation. This page is an
introduction to the Metaphor system. It is designed to give users a
basic understanding of the ideas behind Metaphor and some
suggestions for how to use the sytem.  If you only want to use
Metaphor to create art, see the <a href="usage.html">usage page</a>. If you are a developer
wanting to write tests or additions to Metaphor please see the
separate <a href="technical.html">developer documentation</a>. Enjoy.
</p>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Who made Metaphor? Why? </h3>
<div class="outline-text-3" id="text-1.4">

<p>Metaphor started as a research project at <a href="http://www.lafayette.edu/">Lafayette College</a> in
summer of 2008. The purpose was to explore the power of L-Systems
to generate artistic images. A GUI interface was added in 2009 and
a major rewrite and overhaul of the code brought it up to the
current release in 2010 (v0.2).
</p>
<p>
The original Metaphor core was written in 2008 by <a href="http://basushr.net/">Shrutarshi Basu</a>
(me) . Khine Lin and Rhodes Baker used Metaphor to create images
and added contexts. In 2009 Long Ho and Haruki Yamaguchi created a
GUI on top of the Metaphor core. Samantha Smith wrote a tutorial
for this GUI. I rewrote most the Metaphor core, added features and
wrote this documentation in summer 2010. An improved GUI was
created by <a href="http://cs.lafayette.edu/~kimh/">Paul Kim</a> to interface with the new core. Professor <a href="http://cs.lafayette.edu/~liew">Chun Wai Liew</a> was the advisor for entire project along with artistic
advise from Ed Kerns.
</p></div>
</div>
</div>

</div>
</body>
</html>
